{
  "nav": {
    "home": "Inicio",
    "projects": "Proyectos",
    "about": "Sobre mí",
    "resume": "CV",
    "contact": "Contacto"
  },
  "home": {
    "title": "Melchior JORDA — Desarrollador Web & Software Junior",
    "subtitle": "Creando soluciones digitales eficientes, escalables y centradas en el usuario.",
    "see_projects": "Ver proyectos",
    "contact_me": "Contactarme"
  },
  "footer": {
    "download_cv": "Descargar CV",
    "linkedin": "LinkedIn"
  },
  "contact": {
    "send_message": "Enviar mensaje",
    "title": "Contactar",
    "subtitle": "¡Colaboremos! Contáctame vía LinkedIn, correo o teléfono — o usa el formulario de abajo.",
    "form_title": "Enviar un Mensaje",
    "form": {
      "name": "Nombre",
      "name_placeholder": "Juan Pérez",
      "email": "Correo",
      "email_placeholder": "juan{'@'}ejemplo.com",
      "message": "Mensaje",
      "message_placeholder": "Cuéntame sobre tu proyecto u oportunidad...",
      "send": "Enviar Mensaje"
    },
    "links": {
      "linkedin": "LinkedIn"
    },
    "phone": "Teléfono",
    "phone_hidden": "Haz clic para revelar",
    "email_label": "Correo",
    "email_hidden": "Haz clic para revelar",
    "success_title": "¡Mensaje enviado con éxito!",
    "success_message": "Tu mensaje ha sido enviado. ¡Te responderé lo antes posible!"
  }
  ,
  "projects": {
    "title": "Proyectos",
    "description": "Una colección de mis proyectos de desarrollo web, ingeniería de software y aplicaciones.",
    "example_title": "App de ejemplo",
    "example_description": "Demo: una SPA eficiente construida con Vue y Tailwind.",
    "featured": "Proyectos destacados",
    "placeholder_title": "Título del proyecto (placeholder)",
    "placeholder_description": "Breve descripción del proyecto usando stack web moderno.",
    "view_live": "Ver en vivo",
    "items": {
      "minata-portfolio": {
        "title": "From MY Window - Minata Sartori",
        "description": "Sitio portfolio profesional para la fotógrafa y directora Minata Sartori. Sitio multipágina con galerías de fotos, proyectos de vídeo y trabajos de radio. Totalmente responsive con reproductores multimedia interactivos."
      },
      "trixie-conciergerie": {
        "title": "Trixie Conciergerie",
        "description": "Sitio de servicios de conserjería de lujo para Saint-Tropez. Sistema de reservas, gestión de servicios, limpieza, jardinería y mantenimiento de propiedades. Diseño moderno responsive optimizado para SEO."
      },
      "miss-boat": {
        "title": "Miss Boat",
        "description": "Sitio de alquiler de barcos para Cavalaire-sur-Mer. Alquileres sin licencia desde 16 años. Construido con Vue.js, Vue Router y Tailwind CSS. Páginas de precios, galería y contacto, diseño responsive."
      },
      "elsa-psychologue": {
        "title": "Elsa Psychologue",
        "description": "Sitio profesional para la psicóloga Elsa. Diseño limpio con reserva de citas, información sobre terapias y datos de contacto. Alojado en Firebase."
      },
      "les-planches": {
        "title": "Les Planches",
        "description": "Sitio de un restaurante mediterráneo en Cavalaire-sur-Mer. Galerías animadas para el menú y bebidas, efectos de desplazamiento suaves y diseño responsive."
      },
      "re-fresh-earth": {
        "title": "Re-Fresh Earth",
        "description": "Plataforma medioambiental que combate las islas de calor urbanas usando IA y datos satelitales. Proyecto NASA Space Apps con cartografía térmica y panel para urbanistas."
      },
      "get-next-line": {
        "title": "get_next_line",
        "description": "Función que lee una línea desde un descriptor de archivo. Proyecto que maneja gestión de buffer y asignación de memoria."
      },
      "ft-printf": {
        "title": "ft_printf",
        "description": "Implementación personalizada de la función printf en C. Maneja múltiples especificadores de formato y conversiones."
      },
      "libft": {
        "title": "Libft",
        "description": "Librería C personalizada con funciones estándar reimplementadas. Base para futuros proyectos en C."
      },
      "personal-libft": {
        "title": "Personal Libft",
        "description": "Versión extendida de la librería estándar C con funciones utilitarias adicionales para manipulación de cadenas, gestión de memoria y estructuras de datos."
      },
      "push-swap": {
        "title": "push_swap",
        "description": "Proyecto de algoritmo de ordenación que ordena datos en una pila con un conjunto limitado de instrucciones. Implementa algoritmos eficientes para ordenar enteros usando dos pilas."
      },
      "so-long": {
        "title": "so_long",
        "description": "Juego 2D construido con MiniLibX. Crea un pequeño juego donde un personaje recoge objetos y encuentra la salida. Enfoque en programación gráfica, manejo de eventos y lógica del juego."
      },
      "random-rgb": {
        "title": "Generador RGB Aleatorio",
        "description": "Generador interactivo de colores RGB que crea combinaciones aleatorias. Muestra una vista previa en tiempo real y permite copiar los valores RGB con un clic para usar en proyectos de diseño."
      },
      "form-with-regex": {
        "title": "Validación de Formulario con Regex",
        "description": "Sistema avanzado de validación de formularios usando expresiones regulares. Demuestra validación en tiempo real para emails, números de teléfono, contraseñas y otros campos comunes con patrones regex personalizados."
      },
      "random-password": {
        "title": "Generador de Contraseñas Seguras",
        "description": "Generador de contraseñas personalizable con opciones configurables. Crea contraseñas robustas y seguras eligiendo la longitud y tipos de caracteres: mayúsculas, minúsculas, números y caracteres especiales."
      },
      "projet-sortir": {
        "title": "Projet Sortir",
        "description": "Plataforma de gestión de eventos construida con Symfony. Permite a los usuarios crear, gestionar y unirse a eventos sociales. Características: autenticación de usuarios, filtrado de eventos y operaciones CRUD con base de datos MySQL."
      },
      "series-manager": {
        "title": "Gestor de Series",
        "description": "Aplicación de seguimiento de series de TV construida con Symfony. Gestiona tus series favoritas, haz seguimiento de episodios vistos y descubre nuevas series. Integración de API para datos de series y listas de visualización de usuarios."
      },
      "portfolio-v0": {
        "title": "Portfolio v0.3.4",
        "description": "Mi anterior sitio web de portfolio personal. Diseño clásico con modo oscuro/claro, soporte multilingüe (EN/FR/ES) y presentación de proyectos. Construido con JavaScript vanilla antes de migrar a Vue.js."
      },
      "philosophers": {
        "title": "Philosophers",
        "description": "Proyecto de los filósofos comensales implementado en C usando pthreads y mutex. Simulación de N filósofos evitando deadlock y inanición."
      },
      "minishell": {
        "title": "Minishell",
        "description": "Implementación mínima de un shell en C que soporta parsing, ejecución, redirecciones y builtins. Proyecto educativo con reglas de código estrictas."
      }
    }
  },
  "about": {
    "title": "Sobre Mí",
    "intro": "Soy Melchior JORDA, desarrollador de software y web junior con base en Málaga, España. Apasionado por crear soluciones digitales eficientes y escalables, combino la experiencia técnica de la Escuela 42 con experiencia práctica en desarrollo web y pruebas de videojuegos. Mi experiencia diversa en artes culinarias ha fortalecido mi atención al detalle, gestión del tiempo y habilidades de trabajo en equipo.",
    "experience_title": "Experiencia Profesional",
    "experience": {
      "game_tester": {
        "title": "Probador de Videojuegos en Localsoft",
        "description": "Pruebas de aseguramiento de calidad para videojuegos, informes de errores, colaboración con equipos de desarrollo y cumplimiento de metodologías de prueba estrictas."
      },
      "web_dev": {
        "title": "Proyectos de Desarrollo Web",
        "description": "Creación de sitios web profesionales para clientes incluyendo fotógrafos, restaurantes y proveedores de servicios. Especializado en Vue.js, diseño responsive y tecnologías web modernas."
      }
    },
    "skills_title": "Habilidades Técnicas",
    "skills": {
      "frontend": {
        "title": "Desarrollo Frontend",
        "description": "Vue.js, JavaScript/TypeScript, HTML5/CSS3, Tailwind CSS, Diseño Responsive, Accesibilidad Web"
      },
      "backend": {
        "title": "Backend & Sistemas",
        "description": "C, PHP, Symfony, MySQL, Node.js, Desarrollo de API, Programación de Sistemas"
      },
      "tools": {
        "title": "Herramientas & Métodos",
        "description": "Git/GitHub, VS Code, Pruebas & QA, Metodologías Ágiles, Optimización SEO"
      },
      "languages": {
        "title": "Idiomas",
        "description": "Francés (Nativo), Inglés (Fluido), Español (Intermedio)"
      }
    },
    "education_title": "Educación",
    "education": {
      "school42": {
        "title": "Escuela 42 — Tronco Común (2024-2025)",
        "description": "Aprendizaje entre pares en programación de sistemas, algoritmos y desarrollo de software. Proyectos incluyendo minishell, philosophers y varios desafíos en C."
      },
      "eni": {
        "title": "ENI School — Título Desarrollador Web y Móvil (2023-2024)",
        "description": "Formación completa en desarrollo web y móvil, incluyendo frontend, backend, bases de datos y gestión de proyectos."
      }
    }
  },
  "resume": {
    "title": "CV",
    "download": "Descarga mi CV o consulta los puntos destacados a continuación.",
    "download_link": "Descargar CV (PDF)",
    "profile": {
      "title": "Perfil",
      "description": "Desde joven, la programación ha dado vida a mis ideas. Mi experiencia culinaria me hizo versátil y aprendo rápido, con habilidades en organización, creatividad, trabajo en equipo y atención al detalle."
    },
    "experience": {
      "title": "Experiencia Profesional",
      "game_tester": {
        "title": "Probador de Videojuegos – Localsoft",
        "description": "Como probador LQA en Localsoft, analicé errores, redacté informes de prueba y colaboré con equipos de desarrollo usando herramientas del cliente, perfeccionando mi atención al detalle y metodologías de prueba."
      },
      "internship": {
        "title": "Prácticas - Desarrollador Web",
        "description": "Mejoré en gestión de proyectos, autonomía y vigilancia tecnológica. Utilicé VSCode, Bitbucket, Trello, Node.js, Electron.js, jQuery y MySQL. También reforcé mi trabajo en equipo. Desarrollé una aplicación de quiz y un sitio web para eventos."
      },
      "chef": {
        "title": "Chef",
        "description": "Mi experiencia culinaria perfeccionó mi gestión del tiempo y atención al detalle."
      },
      "various": {
        "title": "Diversos Roles",
        "description": "Mis experiencias en atención domiciliaria y trabajo socioeducativo reforzaron mi adaptabilidad y resolución de problemas."
      }
    },
    "projects": {
      "title": "Proyectos Informáticos",
      "auction": {
        "title": "Sitio de Subastas en Línea",
        "description": "Desarrollado con HTML, Bootstrap, Java y JavaScript: Este proyecto mejoró mi comprensión de la Programación Orientada a Objetos (POO)."
      },
      "event": {
        "title": "Aplicación de Organización de Eventos",
        "description": "Construida con Symfony, desarrollé habilidades en PHP, Twig, MySQL y herramientas como Figma, Trello, PhpStorm y PhpMyAdmin, reforzando mi conocimiento en desarrollo web."
      }
    },
    "skills": {
      "title": "Habilidades de Programación",
      "frontend": {
        "title": "Frontend",
        "description": "Experiencia en HTML/CSS, Javascript, Bootstrap y Angular para crear interfaces dinámicas y responsive."
      },
      "backend": {
        "title": "Backend",
        "description": "Competente en PHP, Symfony, MySQL, Java y C, con experiencia en POO para desarrollo de software."
      },
      "tools": {
        "title": "Herramientas",
        "description": "Uso de Github, Bitbucket, Trello, Figma y SEO para gestión de proyectos y diseños optimizados."
      },
      "languages": {
        "title": "Idiomas",
        "description": "Francés (Nativo), Inglés (Fluido), Español (Intermedio)."
      }
    },
    "education": {
      "title": "Educación",
      "eni": {
        "title": "Título de Desarrollador Web y Móvil",
        "description": "Escuela de Informática ENI"
      },
      "school42": {
        "title": "Tronco Común - Escuela 42",
        "description": "Mayor red de escuelas de informática del mundo"
      }
    },
    "hobbies": {
      "title": "Pasatiempos",
      "description": "Apasionado por el beach-volley, viajes (Asia, Oceanía, Europa) y videojuegos, especialmente juegos de gestión y desarrollo con Unreal Engine."
    }
  },
  "contact_page": {
    "title": "Contacto",
    "subtitle": "Envíame un mensaje — responderé tan pronto como pueda.",
    "label_name": "Tu nombre",
    "label_email": "Tu correo",
    "label_message": "Mensaje"
  }
}
