{
  "nav": {
    "home": "Home",
    "projects": "Projects",
    "about": "About",
    "resume": "Resume",
    "contact": "Contact"
  },
  "home": {
    "title": "Melchior JORDA — Junior Web & Software Developer",
    "subtitle": "Crafting efficient, scalable, and user-focused digital solutions.",
    "see_projects": "See projects",
    "contact_me": "Contact me"
  },
  "footer": {
    "download_cv": "Download CV",
    "linkedin": "LinkedIn"
  },
  "contact": {
    "send_message": "Send message",
    "title": "Get in Touch",
    "subtitle": "Let's collaborate! Reach out via LinkedIn, email, or phone — or use the form below to send me a message.",
    "form_title": "Send a Message",
    "form": {
      "name": "Name",
      "name_placeholder": "John Doe",
      "email": "Email",
      "email_placeholder": "john{'@'}example.com",
      "message": "Message",
      "message_placeholder": "Tell me about your project or opportunity...",
      "send": "Send Message"
    },
    "links": {
      "linkedin": "LinkedIn"
    },
    "phone": "Phone",
    "phone_hidden": "Click to reveal",
    "email_label": "Email",
    "email_hidden": "Click to reveal"
  }
  ,
  "projects": {
    "title": "Projects",
    "description": "A collection of selected projects. I'll add yours when you provide them.",
    "example_title": "Example App",
    "example_description": "Demo: A performant SPA built with Vue and Tailwind.",
    "featured": "Featured projects",
    "placeholder_title": "Project Title (placeholder)",
    "placeholder_description": "Short description of the project using modern web stack.",
    "view_live": "View Live",
    "items": {
      "minata-portfolio": {
        "title": "From MY Window - Minata Sartori",
        "description": "Professional portfolio website for photographer and filmmaker Minata Sartori. Multi-page site featuring photography galleries, video projects, and radio work. Fully responsive with interactive media players."
      },
      "trixie-conciergerie": {
        "title": "Trixie Conciergerie",
        "description": "Luxury concierge services website for Saint-Tropez. Features booking system, service management, cleaning, gardening, and property maintenance. Modern responsive design with SEO optimization."
      },
      "miss-boat": {
        "title": "Miss Boat",
        "description": "Boat rental website for Cavalaire-sur-Mer (French Riviera). License-free boat rentals for ages 16+. Built with Vue.js, Vue Router, and Tailwind CSS. Features pricing page, gallery, contact information, and responsive design."
      },
      "elsa-psychologue": {
        "title": "Elsa Psychologue",
        "description": "Professional website for psychologist Elsa. Clean and calming design with appointment booking, therapy information, and contact details. Built with modern web technologies and Firebase hosting."
      },
      "les-planches": {
        "title": "Les Planches",
        "description": "Mediterranean restaurant website in Cavalaire-sur-Mer. Features animated image galleries for menu and drinks, smooth scroll effects, and responsive design. Modern tapas and wine bar near Saint-Tropez."
      },
      "re-fresh-earth": {
        "title": "Re-Fresh Earth",
        "description": "Environmental platform fighting urban heat islands using AI and satellite data. NASA Space Apps Challenge project featuring predictive machine learning, real-time thermal mapping with Landsat/Sentinel-2/MODIS, and intuitive dashboard for urban planners. Case study: Málaga."
      },
      "get-next-line": {
        "title": "get_next_line",
        "description": "Function that reads a line from a file descriptor. A challenging project that handles buffer management and memory allocation."
      },
      "ft-printf": {
        "title": "ft_printf",
        "description": "Custom implementation of the printf function in C. Handles multiple format specifiers and conversions."
      },
      "libft": {
        "title": "Libft",
        "description": "Custom C library with reimplemented standard functions. Foundation library for all future C projects."
      },
      "personal-libft": {
        "title": "Personal Libft",
        "description": "Extended version of the standard C library with additional utility functions. Enhanced libft with custom implementations for advanced string manipulation, memory management, and data structures."
      },
      "push-swap": {
        "title": "push_swap",
        "description": "Sorting algorithm project that sorts data on a stack with a limited set of instructions. Implements efficient algorithms to sort integers using two stacks and specific operations."
      },
      "so-long": {
        "title": "so_long",
        "description": "2D game project built with MiniLibX. Create a small game where a character collects items and finds an exit. Focuses on graphics programming, event handling, and game logic."
      },
      "random-rgb": {
        "title": "Random RGB",
        "description": "A generator of rgb color, see the color, and copy the rgb"
      },
      "form-with-regex": {
        "title": "Form with Regex",
        "description": "A form with regex for all the inputs."
      },
      "random-password": {
        "title": "Random Password",
        "description": "Here is a generator of random password, you can add how many letters, maj/min, numbers or special caracteres."
      }
      ,
      "philosophers": {
        "title": "Philosophers",
        "description": "Dining philosophers concurrency project implemented in C using pthreads and mutexes. Simulation of N philosophers avoiding deadlock and starvation."
      },
      "minishell": {
        "title": "Minishell",
        "description": "A minimal shell implementation in C supporting parsing, execution, redirections, and builtins. Educational project following strict coding rules."
      }
    }
  },
  "about": {
    "title": "About Me",
    "intro": "I'm Melchior JORDA, a junior software and web developer based in Málaga, Spain. Passionate about creating efficient and scalable digital solutions, I combine technical expertise from École 42 with hands-on experience in web development and video game testing. My diverse background in culinary arts has strengthened my attention to detail, time management, and teamwork skills.",
    "experience_title": "Professional Experience",
    "experience": {
      "game_tester": {
        "title": "Video Game Tester at Localsoft",
        "description": "Quality assurance testing for video games, bug reporting, collaboration with development teams, and adherence to strict testing methodologies."
      },
      "web_dev": {
        "title": "Web Development Projects",
        "description": "Created professional websites for clients including photographers, restaurants, and service providers. Specialized in Vue.js, responsive design, and modern web technologies."
      }
    },
    "skills_title": "Technical Skills",
    "skills": {
      "frontend": {
        "title": "Frontend Development",
        "description": "Vue.js, JavaScript/TypeScript, HTML5/CSS3, Tailwind CSS, Responsive Design, Web Accessibility"
      },
      "backend": {
        "title": "Backend & Systems",
        "description": "C, PHP, Symfony, MySQL, Node.js, API Development, System Programming"
      },
      "tools": {
        "title": "Tools & Methods",
        "description": "Git/GitHub, VS Code, Testing & QA, Agile Methodologies, SEO Optimization"
      },
      "languages": {
        "title": "Languages",
        "description": "French (Native), English (Fluent), Spanish (Intermediate)"
      }
    },
    "education_title": "Education",
    "education": {
      "school42": {
        "title": "École 42 — Common Core (2024-2025)",
        "description": "Peer-to-peer learning in systems programming, algorithms, and software development. Projects include minishell, philosophers, and various C programming challenges."
      },
      "eni": {
        "title": "ENI School — Web & Mobile Developer Degree (2023-2024)",
        "description": "Comprehensive training in web and mobile development, including frontend, backend, databases, and project management."
      }
    }
  },
  "resume": {
    "title": "Resume",
    "download": "Download my resume or view highlights below.",
    "download_link": "Download CV (PDF)",
    "profile": {
      "title": "Profile",
      "description": "From a young age, programming has brought my ideas to life. My culinary background made me versatile and I am a fast learner, with skills in organisation, creativity, teamwork and attention to detail."
    },
    "experience": {
      "title": "Professional Experience",
      "game_tester": {
        "title": "Video Game Tester – Localsoft",
        "description": "As a LQA Tester at Localsoft, I analyzed bugs, wrote test reports, and collaborated with dev teams using client tools, sharpening my attention to detail and testing methodologies."
      },
      "internship": {
        "title": "Internship - Web Developer",
        "description": "I improved in project management, autonomy and technology watch. I used VSCode, Bitbucket, Trello, Node.js, Electron.js, jQuery and MySQL. I also strengthened my teamwork. I developed a quiz app and a website for events."
      },
      "chef": {
        "title": "Chef",
        "description": "My culinary experience honed my time management, attention to detail."
      },
      "various": {
        "title": "Various Roles",
        "description": "My experiences in home care and socio-educational work strengthened my adaptability and problem-solving skills."
      }
    },
    "projects": {
      "title": "IT Projects",
      "auction": {
        "title": "Online Auction Site",
        "description": "Developed with HTML, Bootstrap, Java and JavaScript: This project improved my understanding of Object Oriented Programming (OOP)."
      },
      "event": {
        "title": "Event Organisation Application",
        "description": "Built with Symfony, I developed skills in PHP, Twig, MySQL and tools like Figma, Trello, PhpStorm and PhpMyAdmin, strengthening my knowledge in web development."
      }
    },
    "skills": {
      "title": "Programming Skills",
      "frontend": {
        "title": "Frontend",
        "description": "Experience in HTML/CSS, Javascript, Bootstrap and Angular to create dynamic and responsive interfaces."
      },
      "backend": {
        "title": "Backend",
        "description": "Proficient in PHP, Symfony, MySQL, Java and C, with experience in OOP for software development."
      },
      "tools": {
        "title": "Tools",
        "description": "Use of Github, Bitbucket, Trello, Figma and SEO for project management and optimised designs."
      },
      "languages": {
        "title": "Languages",
        "description": "French (Native), English (Fluent), Spanish (Intermediate)."
      }
    },
    "education": {
      "title": "Education",
      "eni": {
        "title": "Web and Mobile Developer Degree",
        "description": "ENI School of Informatic"
      },
      "school42": {
        "title": "Common Core - School 42",
        "description": "Largest network of IT schools in the world"
      }
    },
    "hobbies": {
      "title": "Hobbies",
      "description": "Passionate about beach-volley, travel (Asia, Oceania, Europe) and video games, especially management games and development with Unreal Engine."
    }
  },
  "contact_page": {
    "title": "Contact",
    "subtitle": "Send me a message — I'll reply as soon as I can.",
    "label_name": "Your name",
    "label_email": "Your email",
    "label_message": "Message"
  }
}
