{
  "nav": {
    "home": "Inicio",
    "projects": "Proyectos",
    "about": "Sobre mí",
    "resume": "CV",
    "contact": "Contacto"
  },
  "home": {
    "title": "Hola, soy Melchior JORDA",
    "subtitle": "Desarrollador web junior — construyendo aplicaciones rápidas, accesibles y mantenibles.",
    "see_projects": "Ver proyectos",
    "contact_me": "Contactarme"
  },
  "footer": {
    "download_cv": "Descargar CV",
    "linkedin": "LinkedIn"
  },
  "contact": {
    "send_message": "Enviar mensaje",
    "title": "Contactar",
    "subtitle": "¡Colaboremos! Contáctame vía LinkedIn, correo o teléfono — o usa el formulario de abajo.",
    "form_title": "Enviar un Mensaje",
    "form": {
      "name": "Nombre",
      "name_placeholder": "Juan Pérez",
      "email": "Correo",
      "email_placeholder": "juan@ejemplo.com",
      "message": "Mensaje",
      "message_placeholder": "Cuéntame sobre tu proyecto u oportunidad...",
      "send": "Enviar Mensaje"
    },
    "links": {
      "linkedin": "LinkedIn"
    },
    "phone": "Teléfono",
    "phone_hidden": "Haz clic para revelar",
    "email_label": "Correo",
    "email_hidden": "Haz clic para revelar"
  }
  ,
  "projects": {
    "title": "Proyectos",
    "description": "Una colección de proyectos seleccionados. Añadiré los tuyos cuando los proporciones.",
    "example_title": "App de ejemplo",
    "example_description": "Demo: una SPA eficiente construida con Vue y Tailwind.",
    "featured": "Proyectos destacados",
    "placeholder_title": "Título del proyecto (placeholder)",
    "placeholder_description": "Breve descripción del proyecto usando stack web moderno.",
    "view_live": "Ver en vivo",
    "items": {
      "minata-portfolio": {
        "title": "From MY Window - Minata Sartori",
        "description": "Sitio portfolio profesional para la fotógrafa y directora Minata Sartori. Sitio multipágina con galerías de fotos, proyectos de vídeo y trabajos de radio. Totalmente responsive con reproductores multimedia interactivos."
      },
      "trixie-conciergerie": {
        "title": "Trixie Conciergerie",
        "description": "Sitio de servicios de conserjería de lujo para Saint-Tropez. Sistema de reservas, gestión de servicios, limpieza, jardinería y mantenimiento de propiedades. Diseño moderno responsive optimizado para SEO."
      },
      "miss-boat": {
        "title": "Miss Boat",
        "description": "Sitio de alquiler de barcos para Cavalaire-sur-Mer. Alquileres sin licencia desde 16 años. Construido con Vue.js, Vue Router y Tailwind CSS. Páginas de precios, galería y contacto, diseño responsive."
      },
      "elsa-psychologue": {
        "title": "Elsa Psychologue",
        "description": "Sitio profesional para la psicóloga Elsa. Diseño limpio con reserva de citas, información sobre terapias y datos de contacto. Alojado en Firebase."
      },
      "les-planches": {
        "title": "Les Planches",
        "description": "Sitio de un restaurante mediterráneo en Cavalaire-sur-Mer. Galerías animadas para el menú y bebidas, efectos de desplazamiento suaves y diseño responsive."
      },
      "re-fresh-earth": {
        "title": "Re-Fresh Earth",
        "description": "Plataforma medioambiental que combate las islas de calor urbanas usando IA y datos satelitales. Proyecto NASA Space Apps con cartografía térmica y panel para urbanistas."
      },
      "get-next-line": {
        "title": "get_next_line",
        "description": "Función que lee una línea desde un descriptor de archivo. Proyecto que maneja gestión de buffer y asignación de memoria."
      },
      "ft-printf": {
        "title": "ft_printf",
        "description": "Implementación personalizada de la función printf en C. Maneja múltiples especificadores de formato y conversiones."
      },
      "libft": {
        "title": "Libft",
        "description": "Librería C personalizada con funciones estándar reimplementadas. Base para futuros proyectos en C."
      },
      "personal-libft": {
        "title": "Personal Libft",
        "description": "Versión extendida de la librería estándar C con funciones utilitarias adicionales para manipulación de cadenas, gestión de memoria y estructuras de datos."
      },
      "push-swap": {
        "title": "push_swap",
        "description": "Proyecto de algoritmo de ordenación que ordena datos en una pila con un conjunto limitado de instrucciones. Implementa algoritmos eficientes para ordenar enteros usando dos pilas."
      },
      "so-long": {
        "title": "so_long",
        "description": "Juego 2D construido con MiniLibX. Crea un pequeño juego donde un personaje recoge objetos y encuentra la salida. Enfoque en programación gráfica, manejo de eventos y lógica del juego."
      },
      "random-rgb": {
        "title": "Random RGB",
        "description": "Generador de colores RGB: ver el color y copiar el valor RGB."
      },
      "form-with-regex": {
        "title": "Form with Regex",
        "description": "Formulario con expresiones regulares para validar todos los campos."
      },
      "random-password": {
        "title": "Random Password",
        "description": "Generador de contraseñas aleatorias, configurable en longitud, mayúsculas/minúsculas, números y caracteres especiales."
      }
      ,
      "philosophers": {
        "title": "Philosophers",
        "description": "Proyecto de los filósofos comensales implementado en C usando pthreads y mutex. Simulación de N filósofos evitando deadlock y inanición."
      },
      "minishell": {
        "title": "Minishell",
        "description": "Implementación mínima de un shell en C que soporta parsing, ejecución, redirecciones y builtins. Proyecto educativo con reglas de código estrictas."
      }
    }
  },
  "about": {
    "title": "Sobre mí",
    "intro": "Soy Melchior JORDA, desarrollador web junior con base en Málaga. Me especializo en construir interfaces web modernas, accesibles y de alto rendimiento con Vue, JavaScript y Tailwind CSS. Estoy disponible para trabajar de forma remota por Europa.",
    "skills_title": "Habilidades",
    "skills": ["JavaScript / TypeScript","Vue 3 / Vue Router","Tailwind CSS, Responsive Design","Rendimiento Web & Accesibilidad","Control de versiones: Git / GitHub"]
  },
  "resume": {
    "title": "CV",
    "download": "Descarga mi CV o consulta los puntos destacados a continuación.",
    "download_link": "Descargar CV (PDF)",
    "profile": {
      "title": "Perfil",
      "description": "Desde joven, la programación ha dado vida a mis ideas. Mi experiencia culinaria me hizo versátil y aprendo rápido, con habilidades en organización, creatividad, trabajo en equipo y atención al detalle."
    },
    "experience": {
      "title": "Experiencia Profesional",
      "game_tester": {
        "title": "Probador de Videojuegos – Localsoft",
        "description": "Como probador LQA en Localsoft, analicé errores, redacté informes de prueba y colaboré con equipos de desarrollo usando herramientas del cliente, perfeccionando mi atención al detalle y metodologías de prueba."
      },
      "internship": {
        "title": "Prácticas - Desarrollador Web",
        "description": "Mejoré en gestión de proyectos, autonomía y vigilancia tecnológica. Utilicé VSCode, Bitbucket, Trello, Node.js, Electron.js, jQuery y MySQL. También reforcé mi trabajo en equipo. Desarrollé una aplicación de quiz y un sitio web para eventos."
      },
      "chef": {
        "title": "Chef",
        "description": "Mi experiencia culinaria perfeccionó mi gestión del tiempo y atención al detalle."
      },
      "various": {
        "title": "Diversos Roles",
        "description": "Mis experiencias en atención domiciliaria y trabajo socioeducativo reforzaron mi adaptabilidad y resolución de problemas."
      }
    },
    "projects": {
      "title": "Proyectos Informáticos",
      "auction": {
        "title": "Sitio de Subastas en Línea",
        "description": "Desarrollado con HTML, Bootstrap, Java y JavaScript: Este proyecto mejoró mi comprensión de la Programación Orientada a Objetos (POO)."
      },
      "event": {
        "title": "Aplicación de Organización de Eventos",
        "description": "Construida con Symfony, desarrollé habilidades en PHP, Twig, MySQL y herramientas como Figma, Trello, PhpStorm y PhpMyAdmin, reforzando mi conocimiento en desarrollo web."
      }
    },
    "skills": {
      "title": "Habilidades de Programación",
      "frontend": {
        "title": "Frontend",
        "description": "Experiencia en HTML/CSS, Javascript, Bootstrap y Angular para crear interfaces dinámicas y responsive."
      },
      "backend": {
        "title": "Backend",
        "description": "Competente en PHP, Symfony, MySQL, Java y C, con experiencia en POO para desarrollo de software."
      },
      "tools": {
        "title": "Herramientas",
        "description": "Uso de Github, Bitbucket, Trello, Figma y SEO para gestión de proyectos y diseños optimizados."
      },
      "languages": {
        "title": "Idiomas",
        "description": "Francés (Nativo), Inglés (Fluido), Español (Intermedio)."
      }
    },
    "education": {
      "title": "Educación",
      "eni": {
        "title": "Título de Desarrollador Web y Móvil",
        "description": "Escuela de Informática ENI"
      },
      "school42": {
        "title": "Tronco Común - Escuela 42",
        "description": "Mayor red de escuelas de informática del mundo"
      }
    },
    "hobbies": {
      "title": "Pasatiempos",
      "description": "Apasionado por el beach-volley, viajes (Asia, Oceanía, Europa) y videojuegos, especialmente juegos de gestión y desarrollo con Unreal Engine."
    }
  },
  "contact_page": {
    "title": "Contacto",
    "subtitle": "Envíame un mensaje — responderé tan pronto como pueda.",
    "label_name": "Tu nombre",
    "label_email": "Tu correo",
    "label_message": "Mensaje"
  }
}
