{
  "nav": {
    "home": "Accueil",
    "projects": "Projets",
    "about": "À propos",
    "resume": "CV",
    "contact": "Contact"
  },
  "home": {
    "title": "Melchior JORDA — Développeur Web & Logiciel Junior",
    "subtitle": "Je crée des solutions numériques efficaces, évolutives et centrées sur l'utilisateur.",
    "see_projects": "Voir les projets",
    "contact_me": "Me contacter"
  },
  "footer": {
    "download_cv": "Télécharger le CV",
    "linkedin": "LinkedIn"
  },
  "contact": {
    "send_message": "Envoyer le message",
    "title": "Entrer en Contact",
    "subtitle": "Collaborons ensemble ! Contactez-moi via LinkedIn, email ou téléphone — ou utilisez le formulaire ci-dessous.",
    "form_title": "Envoyer un Message",
    "form": {
      "name": "Nom",
      "name_placeholder": "Jean Dupont",
      "email": "Email",
      "email_placeholder": "jean@exemple.com",
      "message": "Message",
      "message_placeholder": "Parlez-moi de votre projet ou opportunité...",
      "send": "Envoyer le Message"
    },
    "links": {
      "linkedin": "LinkedIn"
    },
    "phone": "Téléphone",
    "phone_hidden": "Cliquez pour révéler",
    "email_label": "Email",
    "email_hidden": "Cliquez pour révéler"
  }
  ,
  "projects": {
    "title": "Projets",
    "description": "Une collection de projets sélectionnés. J'ajouterai les tiens quand tu les fourniras.",
    "example_title": "Application Exemple",
    "example_description": "Démo : SPA performante construite avec Vue et Tailwind.",
    "featured": "Projets mis en avant",
    "placeholder_title": "Titre du projet (placeholder)",
    "placeholder_description": "Courte description du projet utilisant une stack web moderne.",
    "view_live": "Voir en direct",
    "items": {
      "minata-portfolio": {
        "title": "From MY Window - Minata Sartori",
        "description": "Site portfolio professionnel pour la photographe et réalisatrice Minata Sartori. Site multi-pages avec galeries photo, projets vidéo et travaux radio. Entièrement responsive avec lecteurs médias interactifs."
      },
      "trixie-conciergerie": {
        "title": "Trixie Conciergerie",
        "description": "Site de services de conciergerie de luxe pour Saint-Tropez. Système de réservation, gestion des services, nettoyage, jardinage et maintenance immobilière. Design moderne responsive optimisé pour le SEO."
      },
      "miss-boat": {
        "title": "Miss Boat",
        "description": "Site de location de bateaux pour Cavalaire-sur-Mer. Locations sans permis dès 16 ans. Construit avec Vue.js, Vue Router et Tailwind CSS. Pages tarifaires, galerie et contact, design responsive."
      },
      "elsa-psychologue": {
        "title": "Elsa Psychologue",
        "description": "Site professionnel pour la psychologue Elsa. Design épuré avec prise de rendez-vous, informations sur les thérapies et coordonnées. Hébergé sur Firebase."
      },
      "les-planches": {
        "title": "Les Planches",
        "description": "Site d'un restaurant méditerranéen à Cavalaire-sur-Mer. Galeries animées pour menu et boissons, effets de scroll fluides et design responsive."
      },
      "re-fresh-earth": {
        "title": "Re-Fresh Earth",
        "description": "Plateforme environnementale luttant contre les îlots de chaleur urbains via l'IA et données satellites. Projet NASA Space Apps avec cartographie thermique et dashboard pour urbanistes."
      },
      "get-next-line": {
        "title": "get_next_line",
        "description": "Fonction qui lit une ligne depuis un descripteur de fichier. Projet axé sur la gestion de buffer et l'allocation mémoire."
      },
      "ft-printf": {
        "title": "ft_printf",
        "description": "Implémentation personnalisée de la fonction printf en C. Gère plusieurs spécificateurs de format et conversions."
      },
      "libft": {
        "title": "Libft",
        "description": "Bibliothèque C personnalisée réimplémentant des fonctions standard. Base pour les projets C futurs."
      },
      "personal-libft": {
        "title": "Personal Libft",
        "description": "Version étendue de la bibliothèque standard C avec fonctions utilitaires additionnelles pour manipulation de chaînes, gestion mémoire et structures de données."
      },
      "push-swap": {
        "title": "push_swap",
        "description": "Projet d'algorithme de tri utilisant deux piles et un ensemble d'instructions limitées. Implémente des algorithmes efficaces pour trier des entiers."
      },
      "so-long": {
        "title": "so_long",
        "description": "Jeu 2D créé avec MiniLibX. Le joueur collecte des objets et trouve une sortie. Concentre sur la programmation graphique, gestion d'événements et logique de jeu."
      },
      "random-rgb": {
        "title": "Random RGB",
        "description": "Générateur de couleurs RGB : voir la couleur et copier la valeur RGB."
      },
      "form-with-regex": {
        "title": "Form with Regex",
        "description": "Formulaire avec expressions régulières pour valider tous les champs."
      },
      "random-password": {
        "title": "Random Password",
        "description": "Générateur de mots de passe aléatoires, configurable en longueur, majuscules/minuscules, chiffres et caractères spéciaux."
      }
      ,
      "philosophers": {
        "title": "Philosophers",
        "description": "Projet des philosophes dînant implémenté en C utilisant pthreads et mutex. Simulation de N philosophes évitant deadlock et famine."
      },
      "minishell": {
        "title": "Minishell",
        "description": "Implémentation minimale d'un shell en C supportant le parsing, l'exécution, les redirections et les builtins. Projet pédagogique avec règles de code strictes."
      }
    }
  },
  "about": {
    "title": "À propos de Moi",
    "intro": "Je suis Melchior JORDA, développeur logiciel et web junior basé à Málaga, en Espagne. Passionné par la création de solutions numériques efficaces et évolutives, je combine l'expertise technique de l'École 42 avec une expérience pratique en développement web et test de jeux vidéo. Mon parcours diversifié dans les arts culinaires a renforcé mon attention aux détails, ma gestion du temps et mes compétences en travail d'équipe.",
    "experience_title": "Expérience Professionnelle",
    "experience": {
      "game_tester": {
        "title": "Testeur de Jeux Vidéo chez Localsoft",
        "description": "Tests d'assurance qualité pour jeux vidéo, rapports de bugs, collaboration avec les équipes de développement et respect des méthodologies de test strictes."
      },
      "web_dev": {
        "title": "Projets de Développement Web",
        "description": "Création de sites web professionnels pour des clients incluant photographes, restaurants et prestataires de services. Spécialisé en Vue.js, design responsive et technologies web modernes."
      }
    },
    "skills_title": "Compétences Techniques",
    "skills": {
      "frontend": {
        "title": "Développement Frontend",
        "description": "Vue.js, JavaScript/TypeScript, HTML5/CSS3, Tailwind CSS, Design Responsive, Accessibilité Web"
      },
      "backend": {
        "title": "Backend & Systèmes",
        "description": "C, PHP, Symfony, MySQL, Node.js, Développement d'API, Programmation Système"
      },
      "tools": {
        "title": "Outils & Méthodes",
        "description": "Git/GitHub, VS Code, Tests & QA, Méthodologies Agiles, Optimisation SEO"
      },
      "languages": {
        "title": "Langues",
        "description": "Français (Natif), Anglais (Courant), Espagnol (Intermédiaire)"
      }
    },
    "education_title": "Formation",
    "education": {
      "school42": {
        "title": "École 42 — Tronc Commun (2024-2025)",
        "description": "Apprentissage peer-to-peer en programmation système, algorithmes et développement logiciel. Projets incluant minishell, philosophers et divers défis en C."
      },
      "eni": {
        "title": "ENI School — Diplôme Développeur Web et Mobile (2023-2024)",
        "description": "Formation complète en développement web et mobile, incluant frontend, backend, bases de données et gestion de projet."
      }
    }
  },
  "resume": {
    "title": "CV",
    "download": "Télécharge mon CV ou consulte les points saillants ci-dessous.",
    "download_link": "Télécharger le CV (PDF)",
    "profile": {
      "title": "Profil",
      "description": "Depuis mon jeune âge, la programmation donne vie à mes idées. Mon parcours culinaire m'a rendu polyvalent et j'apprends vite, avec des compétences en organisation, créativité, travail d'équipe et souci du détail."
    },
    "experience": {
      "title": "Expérience Professionnelle",
      "game_tester": {
        "title": "Testeur de Jeux Vidéo – Localsoft",
        "description": "En tant que testeur LQA chez Localsoft, j'ai analysé des bugs, rédigé des rapports de test et collaboré avec les équipes de développement en utilisant les outils clients, affinant mon attention aux détails et mes méthodologies de test."
      },
      "internship": {
        "title": "Stage - Développeur Web",
        "description": "J'ai progressé en gestion de projet, autonomie et veille technologique. J'ai utilisé VSCode, Bitbucket, Trello, Node.js, Electron.js, jQuery et MySQL. J'ai également renforcé mon travail d'équipe. J'ai développé une application de quiz et un site web pour des événements."
      },
      "chef": {
        "title": "Chef Cuisinier",
        "description": "Mon expérience culinaire a affiné ma gestion du temps et mon attention aux détails."
      },
      "various": {
        "title": "Divers Postes",
        "description": "Mes expériences dans l'aide à domicile et le travail socio-éducatif ont renforcé mon adaptabilité et ma résolution de problèmes."
      }
    },
    "projects": {
      "title": "Projets Informatiques",
      "auction": {
        "title": "Site d'Enchères en Ligne",
        "description": "Développé avec HTML, Bootstrap, Java et JavaScript : Ce projet a amélioré ma compréhension de la Programmation Orientée Objet (POO)."
      },
      "event": {
        "title": "Application d'Organisation d'Événements",
        "description": "Construit avec Symfony, j'ai développé des compétences en PHP, Twig, MySQL et des outils comme Figma, Trello, PhpStorm et PhpMyAdmin, renforçant mes connaissances en développement web."
      }
    },
    "skills": {
      "title": "Compétences en Programmation",
      "frontend": {
        "title": "Frontend",
        "description": "Expérience en HTML/CSS, Javascript, Bootstrap et Angular pour créer des interfaces dynamiques et responsives."
      },
      "backend": {
        "title": "Backend",
        "description": "Compétent en PHP, Symfony, MySQL, Java et C, avec expérience en POO pour le développement logiciel."
      },
      "tools": {
        "title": "Outils",
        "description": "Utilisation de Github, Bitbucket, Trello, Figma et SEO pour la gestion de projets et des designs optimisés."
      },
      "languages": {
        "title": "Langues",
        "description": "Français (Natif), Anglais (Courant), Espagnol (Intermédiaire)."
      }
    },
    "education": {
      "title": "Formation",
      "eni": {
        "title": "Diplôme Développeur Web et Mobile",
        "description": "École Informatique ENI"
      },
      "school42": {
        "title": "Tronc Commun - École 42",
        "description": "Plus grand réseau d'écoles informatiques au monde"
      }
    },
    "hobbies": {
      "title": "Loisirs",
      "description": "Passionné par le beach-volley, les voyages (Asie, Océanie, Europe) et les jeux vidéo, notamment les jeux de gestion et le développement avec Unreal Engine."
    }
  },
  "contact_page": {
    "title": "Contact",
    "subtitle": "Envoie-moi un message — je répondrai dès que possible.",
    "label_name": "Ton nom",
    "label_email": "Ton email",
    "label_message": "Message"
  }
}
